# Advent of SQL

In [2]:
import pandas as pd
from dotenv import load_dotenv
import os

In [ ]:
# Load environment variables from the .env file
load_dotenv()

# Get username and pwd
username = os.getenv('PG_USERNAME')
pwd = os.getenv('PG_PASSWORD')

In [4]:
%load_ext sql

# Connecting to db
%sql postgresql://{username}:{pwd}@localhost:5432/santa_workshop

# Fixing 'pretty-table' bug
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

### <b>Day 1:</b> Santa's Gift Lists Parser
- JSON, CASE, JOINS

In [ ]:
%%sql

SELECT name,
    wishes->>'first_choice' as primary_wish,
    wishes->>'second_choice' as backup_wish,
    (wishes->'colors'->>0) AS favorite_color,
    json_array_length(wishes::json->'colors') as color_count,
    CASE 
        WHEN difficulty_to_make = 1 THEN 'Simple Gift'
        WHEN difficulty_to_make = 2 THEN 'Moderate Gift'
        WHEN difficulty_to_make >= 3 THEN 'Complex Gift'
    END AS gift_complexity,
    CASE 
        WHEN category = 'outdoor' THEN 'Outside Workshop'
        WHEN category = 'educational' THEN 'Learning Workshop'
        ELSE 'General Workshop'
    END AS workshop_assignment
from 
    wish_lists
    INNER JOIN children
    ON wish_lists.child_id = children.child_id
    LEFT JOIN toy_catalogue 
    ON wish_lists.wishes->>'first_choice' = toy_catalogue.toy_name
ORDER BY 
    name ASC
LIMIT 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[('Abagail', 'Building sets', 'LEGO blocks', 'Blue', 1, 'Complex Gift', 'Learning Workshop'),
 ('Abbey', 'Stuffed animals', 'Teddy bears', 'White', 4, 'Complex Gift', 'General Workshop'),
 ('Abbey', 'Toy trains', 'Toy trains', 'Pink', 2, 'Complex Gift', 'General Workshop'),
 ('Abbey', 'Barbie dolls', 'Play-Doh', 'Purple', 1, 'Moderate Gift', 'General Workshop'),
 ('Abbey', 'Yo-yos', 'Building blocks', 'Blue', 5, 'Simple Gift', 'General Workshop')]

### <b>Day 2:</b> Santa's Jumbled Letters
- UNION, CTE, ASCII, STRING_AGG (function to concatenate strings and place a sep between them)

In [ ]:
%%sql
-- Solution by friekert on Reddit

SELECT string_agg(character, '')
from (
  SELECT chr(value) as character from letters_a
  UNION ALL
  SELECT chr(value) from letters_b
) subquery
WHERE subquery.character ~* '[a-zA-Z\s!?,.;:()-]';

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('Dear Santa, I hope this letter finds you well in the North Pole! I want a SQL course for Christmas!\n',)]

### <b>Day 3:</b> The Greatest Christmas Dinner Ever!
- CTE, XML

In [ ]:
%%sql 

WITH parsed_data AS (
    SELECT
        COALESCE(
            (xpath('//total_present/text()', menu_data))[1]::text::integer,
            (xpath('//total_count/text()', menu_data))[1]::text::integer,
            (xpath('//total_guests/text()', menu_data))[1]::text::integer
        ) AS total_guests,
        (xpath('//food_item_id/text()', menu_data))::text[] AS array_food_item
    from christmas_menus
)

SELECT
    food_item,
    COUNT(*) AS frequency
FROM parsed_data,
    UNNEST(array_food_item) AS food_item
WHERE total_guests > 78
GROUP BY food_item
ORDER BY frequency DESC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('493', 117)]

### <b>Day 4:</b> The Great Toy Tag Migration of 2024

- Array functions, SET operations

In [ ]:
%%sql

SELECT toy_id, 
    -- Count new tags that were added
    (SELECT COUNT(*) 
    from (
        SELECT UNNEST(new_tags) 
        EXCEPT 
        SELECT UNNEST(previous_tags)) as added_set) as added_tags,
    -- Count unchanged tags
    (SELECT COUNT(*) 
    from (
        SELECT UNNEST(new_tags) 
        INTERSECT 
        SELECT UNNEST(previous_tags)) as unchanged_set) as unchanged_tags,
    -- Count removed tags
    (SELECT COUNT(*) 
    from (
        SELECT UNNEST(previous_tags) 
        EXCEPT 
        SELECT UNNEST(new_tags)) as removed_set) as removed_tags
from toy_production
ORDER BY added_tags DESC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(2726, 98, 2, 0)]

### <b>Day 5:</b> Santa's Production Dashboard

- LAG (function to access a previous row from a column), ROUND, Window functions

In [ ]:
%%sql

WITH diff_calc as (
    SELECT production_date, 
        toys_produced, 
        LAG(toys_produced) OVER (ORDER BY production_date) as previous_day_production
    from toy_production
)
SELECT production_date, 
    toys_produced,
    previous_day_production,
    toys_produced - previous_day_production as production_change,
    ROUND((toys_produced - previous_day_production) * 100.00 / previous_day_production, 2) as production_change_percentage
from diff_calc
ORDER BY production_change_percentage DESC nulls last
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(datetime.date(2017, 3, 20), 2327, 3, 2324, Decimal('77466.67'))]

### <b>Day 6:</b> Making Presents Fairer

- Subquery, Aggregates

In [ ]:
%%sql

SELECT children.name as child_name,
    gifts.name as gift_name,
    gifts.price as gift_price
from children
INNER JOIN gifts
ON children.child_id = gifts.child_id
WHERE gifts.price >
    (SELECT AVG(gifts.price)
        FROM gifts)
ORDER BY gifts.price ASC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('Hobart', 'art easel', Decimal('497.44'))]

### <b>Day 7:</b> Santa's Cartesian Elf Skill-Matching Program

- Window functions

In [ ]:
%%sql

SELECT DISTINCT
    FIRST_VALUE(elf_id) OVER (PARTITION BY primary_skill ORDER BY years_experience DESC, elf_id) as max_years_experience,
    FIRST_VALUE(elf_id) OVER (PARTITION BY primary_skill ORDER BY years_experience, elf_id) as min_years_experience,
    primary_skill as shared_skill
from workshop_elves
ORDER BY max_years_experience
LIMIT 3;

 * postgresql://tovat:***@localhost:5432/santa_workshop
3 rows affected.

[(50, 13551, 'Toy making'),
 (4153, 3611, 'Gift sorting'),
 (10497, 1016, 'Gift wrapping')]

### <b>Day 8:</b> The Great North Pole Bureaucracy Bust of 2024

- Recursive CTE

In [19]:
%%sql

WITH RECURSIVE managers as (
    SELECT staff_id, 
        staff_name,
        manager_id
    FROM staff
UNION ALL
    SELECT s.staff_id, 
        s.staff_name, 
        s.manager_id
    FROM staff s
    INNER JOIN managers m 
    ON s.manager_id = m.staff_id
)
SELECT staff_id, count(*)
FROM managers
GROUP BY staff_id
ORDER BY 2 DESC
LIMIT 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[(57121, 24), (65616, 24), (51291, 24), (54839, 24), (65631, 24)]

### <b>Day 9:</b> Reindeer Training Records 🦌

- CTE, Aggregate functions

In [21]:
%%sql 

SELECT *
from training_sessions
Limit 10;

 * postgresql://tovat:***@localhost:5432/santa_workshop
10 rows affected.

[(1, 1, 'Rooftop Landing', Decimal('76.00'), datetime.date(2024, 12, 6), 'Starry'),
 (2, 1, 'Emergency Stop', Decimal('70.00'), datetime.date(2024, 12, 5), 'Moonlit'),
 (3, 1, 'Weather Endurance', Decimal('78.00'), datetime.date(2024, 12, 4), 'Aurora'),
 (4, 1, 'Sprint Start', Decimal('98.00'), datetime.date(2024, 12, 3), 'Clear'),
 (5, 1, 'High-Speed Turn', Decimal('90.00'), datetime.date(2024, 12, 2), 'Starry'),
 (6, 1, 'Formation Flying', Decimal('83.00'), datetime.date(2024, 12, 1), 'Starry'),
 (7, 1, 'Sprint Start', Decimal('86.00'), datetime.date(2024, 11, 30), 'Windy'),
 (8, 1, 'Sprint Start', Decimal('70.00'), datetime.date(2024, 11, 29), 'Foggy'),
 (9, 1, 'Emergency Stop', Decimal('75.00'), datetime.date(2024, 11, 28), 'Clear'),
 (10, 1, 'Gift Load Balance', Decimal('81.00'), datetime.date(2024, 11, 27), 'Moonlit')]

In [54]:
%%sql

WITH calc_avg_speed as ( 
    SELECT t.reindeer_id,
        r.reindeer_name,
        t.exercise_name,
        AVG(t.speed_record) as avg_speed_per_exercise_type
    FROM training_sessions t
    JOIN reindeers r
    ON t.reindeer_id = r.reindeer_id
    WHERE r.reindeer_name <> 'Rudolf'
    GROUP BY t.reindeer_id, r.reindeer_name, t.exercise_name
    ORDER BY reindeer_id
)

SELECT reindeer_name,
    ROUND(MAX(avg_speed_per_exercise_type), 2) as highest_average_score
FROM calc_avg_speed
GROUP BY reindeer_id, reindeer_name
ORDER BY highest_average_score DESC
LIMIT 3;

 * postgresql://tovat:***@localhost:5432/santa_workshop
3 rows affected.

[('Cupid', Decimal('88.64')),
 ('Blitzen', Decimal('88.38')),
 ('Vixen', Decimal('88.01'))]